---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.HostChangeDisallowsLoadOrBoundaryConditions
source: html/b4c7f44c-5e6b-2ebd-776e-fa5934ff61ed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.HostChangeDisallowsLoadOrBoundaryConditions Property

Some Hosted Loads or BoundaryConditions lost their References. They will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId HostChangeDisallowsLoadOrBoundaryConditions { get; }
```